# Basic taps
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "curl"
brew "wget"
brew "fish"
brew "git"
brew "svn" # for some of the fonts
brew "gnupg"
brew "gpgme" # JSON inter-process communication for GPG
brew "neofetch"
brew "neovim"
brew "pinentry-mac"
brew "tmux"
brew "mas"
brew "yt-dlp"
brew "mpv"
brew "ffmpeg"
brew "meson" # for mpv compilation
brew "gitui"
brew "ranger"

# Programming Language Support
brew "ipython"
brew "tectonic"
brew "ctags"
brew "pyenv"
brew "rbenv"

# fonts
cask "font-source-code-pro"

cask "google-chrome"
cask "google-drive"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "microsoft-excel"
cask "firefox"
cask "baidunetdisk"
cask "blender"
cask "discord"
cask "fork"
cask "iina"
cask "keka"
cask "netnewswire"
cask "skim"
cask "telegram"
cask "transmission"
cask "wechat"
cask "xld"
cask "yacreader"
cask "zoom"
cask "raycast"
cask "alacritty"
cask "notion"
cask "slack"
cask "coteditor"
cask "steam"
cask "istat-menus"
cask "sf-symbols"
cask "dash"
cask "visual-studio-code"
cask "mactex"
cask "hex-fiend"

mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
# mas "1Password", id: 443987910
mas "Microsoft To Do", id: 1274495053
mas "AdGuard for Safari", id: 1440147259
mas "1Password for Safari", id: 1569813296
mas "Deliveries", id: 290986013
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "LINE", id: 539883307
